{
  "profile": {
    "name": "Frieze Kere Wandabwa",
    "title": "Senior IT Executive",
    "email": "friezekw@gmail.com",
    "phone": "+254 718 300 236",
    "location": "Nairobi, Kenya",
    "linkedin": "https://www.linkedin.com/in/frieze-wandabwa-224383178/",
    "website": "https://www.friezewandabwa.it.com/",
    "github": "https://github.com/FRIEZEWANDABWAc",
    "photo": null
  },
  "summary": "Senior IT Executive with over 10 years of progressive leadership experience overseeing enterprise technology strategy, governance, and operations across regulated and multi-site environments. Proven expertise in aligning IT infrastructure, cybersecurity, and enterprise systems with institutional objectives in high-compliance sectors.\n\nExperienced in driving digital enablement, strengthening data governance frameworks, managing mission-critical infrastructure, and delivering secure, scalable platforms that support operational excellence and decision-making. Recognized for building resilient IT environments, optimizing budgets, leading cross-functional collaboration, and advising executive leadership on technology risk and innovation. A highly dependable systems thinker with a consistent track record of aligning academic, clinical, and administrative IT objectives with state-of-the-art technological advancement and governance policies.",
  "positioning": "executive",
  "keyStats": {
    "yearsExperience": "10+ Years IT Leadership",
    "teamSize": "Multi-site Operations",
    "budgetOwnership": "Multi-Million Budget Oversight"
  },
  "executiveScale": "10+ Years IT Leadership  ·  Enterprise Systems & ERP  ·  Regulatory Compliance  ·  Budget Oversight",
  "skills": {
    "technical": [
      "Microsoft Dynamics Business Central & ERP Oversight",
      "Cloud & Hybrid Infrastructure (Azure, M365)",
      "Disaster Recovery & Business Continuity Planning",
      "Enterprise Networking & Secure Architecture",
      "Hyper-V & VMware Virtualization Deployment",
      "End-user Compute & ITSM Tools Administration",
      "SaaS Administration (LMS, EHR integrations, CRM)"
    ],
    "governance": [
      "IT Governance, Policy & Regulatory Compliance",
      "Cybersecurity Programs & ISO 27001 Frameworks",
      "Data Protection & Risk Management",
      "IT Service Management (ITIL 4)",
      "Information Security Management Systems (ISMS)",
      "System Audit Readiness & Remediation",
      "Data Privacy Standards Implementation"
    ],
    "leadership": [
      "Enterprise IT Strategy & Institutional Alignment",
      "IT Budget Management & Cost Optimization",
      "Vendor Governance & Contract Negotiation",
      "Executive Reporting & Stakeholder Engagement",
      "Cross-functional Team Mentorship & Leadership",
      "Project Management & Change Enablement",
      "Digital Enablement & Workflow Automation"
    ]
  },
  "experiences": [
    {
      "id": "exp-001",
      "company": "KOFISI AFRICA",
      "role": "IT Manager – Kenya",
      "period": "Sept 2022 – Present",
      "location": "Nairobi, Kenya",
      "visible": true,
      "achievements": [
        {
          "id": "ach-001-1",
          "text": "Lead enterprise IT strategy, governance, and operational oversight across 15 business centers supporting over 1,000 users and multinational institutional clients.",
          "metrics": "15 business centers",
          "tags": [
            "Strategy",
            "Leadership"
          ]
        },
        {
          "id": "ach-001-2",
          "text": "Developed and executed an enterprise IT roadmap strictly aligned with organizational expansion, academic facility goals, and structural operational resilience objectives.",
          "metrics": "",
          "tags": [
            "IT Roadmap"
          ]
        },
        {
          "id": "ach-001-3",
          "text": "Established comprehensive IT governance structures including access control policies, data protection protocols, acceptable use requirements, and enterprise operational risk frameworks.",
          "metrics": "",
          "tags": [
            "Governance",
            "Compliance"
          ]
        },
        {
          "id": "ach-001-4",
          "text": "Regularly advise executive leadership and board stakeholders on ongoing cybersecurity posture, emerging technology risks, and infrastructure investment planning to secure operations.",
          "metrics": "",
          "tags": [
            "Cybersecurity",
            "Risk Management"
          ]
        },
        {
          "id": "ach-001-5",
          "text": "Implemented highly structured, data-driven IT performance reporting to support executive leadership decision-making and ensure alignment with quarterly institutional objectives.",
          "metrics": "",
          "tags": [
            "Reporting"
          ]
        },
        {
          "id": "ach-001-6",
          "text": "Complete oversight of enterprise platforms including the Microsoft 365 ecosystem, organizational collaboration systems, VoIP infrastructure, and core financial system integrations.",
          "metrics": "",
          "tags": [
            "Enterprise Systems"
          ]
        },
        {
          "id": "ach-001-7",
          "text": "Managed the critical ongoing integration of secure access gateways, strict identity governance, and continuous endpoint protection systems across all distributed regional locations.",
          "metrics": "",
          "tags": [
            "Security",
            "Identity"
          ]
        },
        {
          "id": "ach-001-8",
          "text": "Spearheaded cloud-first migration and modernization initiatives utilizing Microsoft Azure, dramatically improving system scalability, data security, and operational continuity for distributed teams.",
          "metrics": "",
          "tags": [
            "Cloud",
            "Azure"
          ]
        },
        {
          "id": "ach-001-9",
          "text": "Directly supported enterprise financial operations using Microsoft Dynamics Business Central, ensuring continuous system reliability, rigorous user access governance, and strict data integrity controls.",
          "metrics": "",
          "tags": [
            "Dynamics Business Central",
            "ERP"
          ]
        },
        {
          "id": "ach-001-10",
          "text": "Implemented foundational cybersecurity governance completely aligned with global ISO 27001 best practices and corresponding institutional audit requirements.",
          "metrics": "ISO 27001",
          "tags": [
            "ISO 27001",
            "Cybersecurity"
          ]
        },
        {
          "id": "ach-001-11",
          "text": "Designed, documented, and successfully piloted disaster recovery (DR) and business continuity planning (BCP) frameworks, ensuring 99.9% institutional system availability.",
          "metrics": "99.9% availability",
          "tags": [
            "Disaster Recovery"
          ]
        },
        {
          "id": "ach-001-12",
          "text": "Conducted exhaustive quarterly IT risk assessments and implemented long-term mitigation controls that measurably reduced external network vulnerabilities by over 30%.",
          "metrics": "30% reduction",
          "tags": [
            "Risk Assessment"
          ]
        },
        {
          "id": "ach-001-13",
          "text": "Substantially strengthened endpoint security, network perimeter defenses, and continuous log monitoring frameworks across all deployed institutional sites.",
          "metrics": "",
          "tags": [
            "Endpoint Security"
          ]
        },
        {
          "id": "ach-001-14",
          "text": "Fully managed multi-site IT operational and capital expense budgets tightly coupled with rigorous vendor contract negotiation, achieving 20% cost optimization without compromising critical service quality.",
          "metrics": "20% optimization",
          "tags": [
            "Budget",
            "Cost Optimization"
          ]
        },
        {
          "id": "ach-001-15",
          "text": "Negotiated demanding SLAs with external technology providers and OEMs, strictly ensuring compliance and continuous, measurable technical support service improvements.",
          "metrics": "",
          "tags": [
            "Vendor Management"
          ]
        },
        {
          "id": "ach-001-16",
          "text": "Strategically forecasted capital and operational technology investment requirements accurately tracking alongside the institution's long-term scale and growth strategy.",
          "metrics": "",
          "tags": [
            "Investment Planning"
          ]
        },
        {
          "id": "ach-001-17",
          "text": "Systematically built, trained, and continually mentored high-performing, cross-functional engineering and IT support teams deployed uniquely across multiple distributed centers.",
          "metrics": "",
          "tags": [
            "Team Leadership"
          ]
        },
        {
          "id": "ach-001-18",
          "text": "Established clear ITIL 4 aligned KPI frameworks and SLA service standards, effectively reducing standard incident resolution operational time globally by over 40%.",
          "metrics": "40% reduction",
          "tags": [
            "KPIs",
            "ITSM"
          ]
        },
        {
          "id": "ach-001-19",
          "text": "Organically fostered a durable institutional culture of accountability, continuous operational improvement, and highly structured, user-oriented IT service delivery at scale.",
          "metrics": "",
          "tags": [
            "Service Delivery"
          ]
        },
        {
          "id": "ach-001-20",
          "text": "Championed digital capability enhancements, successfully deploying secure virtual environments and robust collaboration solutions to guarantee remote connectivity and institutional resilience.",
          "metrics": "",
          "tags": [
            "Remote Connectivity"
          ]
        },
        {
          "id": "ach-001-21",
          "text": "Authored, revised, and enforced over two dozen standard operating procedures (SOPs) pertaining to hardware lifecycle management, provisioning, and secure decommissioning.",
          "metrics": "",
          "tags": [
            "SOPs",
            "Hardware Lifecycle"
          ]
        }
      ]
    },
    {
      "id": "exp-002",
      "company": "TELESYS SOLUTIONS LIMITED",
      "role": "Regional IT & Network Manager",
      "period": "Jan 2020 – Aug 2022",
      "location": "Nairobi, Kenya",
      "visible": true,
      "achievements": [
        {
          "id": "ach-002-1",
          "text": "Provided high-level regional IT leadership uniformly across 500+ complex infrastructure deployments while overseeing strict project compliance, vendor governance, and high-quality operational execution across overlapping multi-region projects.",
          "metrics": "500+ deployments",
          "tags": [
            "Leadership",
            "Infrastructure"
          ]
        },
        {
          "id": "ach-002-2",
          "text": "Administrated and executed against competitive multi-million-shilling infrastructure deployment budgets, successfully mandating strict cost controls and financial transparency protocols to executive leadership.",
          "metrics": "Multi-million budget",
          "tags": [
            "Budget"
          ]
        },
        {
          "id": "ach-002-3",
          "text": "Aggressively negotiated multi-tiered vendor supply contracts and complex service agreements with tier-1 global OEMs, specifically including Huawei, Nokia, Cisco, and Ericsson.",
          "metrics": "",
          "tags": [
            "Vendor Negotiation"
          ]
        },
        {
          "id": "ach-002-4",
          "text": "Meticulously standardized multi-site deployment operational compliance frameworks (encompassing ISO quality benchmarks and rigorous occupational safety standards), directly improving macro project governance predictability.",
          "metrics": "ISO",
          "tags": [
            "Compliance"
          ]
        },
        {
          "id": "ach-002-5",
          "text": "Proactively led, cross-trained, and supported diverse cross-functional technical delivery teams, firmly ensuring highly consistent physical infrastructure deployment and ongoing regional operational risk mitigation.",
          "metrics": "",
          "tags": [
            "Team Leadership"
          ]
        },
        {
          "id": "ach-002-6",
          "text": "Executed thorough network topology redesigns for wide-area routing distributions, guaranteeing optimal bandwidth capacity thresholds were maintained despite substantial regional onboarding and expanding project scope.",
          "metrics": "",
          "tags": [
            "Network Design"
          ]
        },
        {
          "id": "ach-002-7",
          "text": "Spearheaded the integration of centralized predictive monitoring analytics, effectively transitioning regional support operations from historically reactive troubleshooting cycles to proactive infrastructural health maintenance paradigms.",
          "metrics": "",
          "tags": [
            "Monitoring"
          ]
        },
        {
          "id": "ach-002-8",
          "text": "Directly resolved entrenched level-3 network routing issues and hardware fault scenarios internally escalated from regional supervisors, mitigating cascading regional downtime against challenging contractual SLAs.",
          "metrics": "",
          "tags": [
            "Troubleshooting",
            "L3 Support"
          ]
        }
      ]
    },
    {
      "id": "exp-003",
      "company": "COMMUNICATION AUTHORITY OF KENYA",
      "role": "Assistant IT Officer",
      "period": "Jan 2019 – Dec 2019",
      "location": "Nairobi, Kenya",
      "visible": true,
      "achievements": [
        {
          "id": "ach-003-1",
          "text": "Critically contributed to sprawling, enterprise-wide ISO 27001-aligned ISMS initiatives intended to protect and harden sensitive institutional operations across internal networks.",
          "metrics": "ISO 27001",
          "tags": [
            "ISMS",
            "Compliance"
          ]
        },
        {
          "id": "ach-003-2",
          "text": "Dramatically strengthened centralized digital records governance frameworks, ensuring auditable, secure, and resilient continuity access across a sensitive repository containing upwards of 50,000+ specialized regulatory records.",
          "metrics": "50,000+ records",
          "tags": [
            "Data Governance"
          ]
        },
        {
          "id": "ach-003-3",
          "text": "Proactively supported intensive regulatory compliance audits and structured enterprise ICT data management processes, ensuring comprehensive alignment to strict governmental frameworks and security mandates.",
          "metrics": "",
          "tags": [
            "Compliance"
          ]
        },
        {
          "id": "ach-003-4",
          "text": "Managed frontline access control administration and periodic systemic access recertification reviews across sensitive domain networks, tightly restricting unauthorized internal exposure per required framework principles.",
          "metrics": "",
          "tags": [
            "Access Control"
          ]
        },
        {
          "id": "ach-003-5",
          "text": "Assisted with end-to-end IT service delivery execution tasks, swiftly troubleshooting administrative hardware environments, executing localized software updates, and managing core peripheral endpoint integrations.",
          "metrics": "",
          "tags": [
            "ITSM",
            "End-user Support"
          ]
        }
      ]
    },
    {
      "id": "exp-004",
      "company": "KENYA CIVIL AVIATION AUTHORITY",
      "role": "ICT Intern",
      "period": "June 2018 – Sept 2018",
      "location": "Nairobi, Kenya",
      "visible": true,
      "achievements": [
        {
          "id": "ach-004-1",
          "text": "Supported core infrastructure provisioning functions securely operating within highly restricted aviation governance and operational facility boundaries.",
          "metrics": "",
          "tags": [
            "Infrastructure",
            "Compliance"
          ]
        },
        {
          "id": "ach-004-2",
          "text": "Maintained and thoroughly tested essential backup power and uninterrupted hardware continuity systems supporting mission-critical sector communication arrays.",
          "metrics": "",
          "tags": [
            "Infrastructure",
            "Maintenance"
          ]
        },
        {
          "id": "ach-004-3",
          "text": "Executed meticulous software and firmware upgrades across localized workstation environments specifically avoiding service degradation of live monitoring assets.",
          "metrics": "",
          "tags": [
            "Upgrades"
          ]
        }
      ]
    }
  ],
  "education": [
    {
      "id": "edu-001",
      "degree": "Master of Science",
      "field": "Artificial Intelligence",
      "institution": "Open University of Kenya",
      "year": "2025 – Present",
      "visible": true
    },
    {
      "id": "edu-002",
      "degree": "Bachelor of Science",
      "field": "Telecommunication & Information Technology",
      "institution": "Kenyatta University",
      "year": "2014 – 2019",
      "visible": true
    }
  ],
  "certifications": [
    {
      "id": "cert-001",
      "name": "ITIL 4 Foundation",
      "issuer": "PeopleCert",
      "year": "2025",
      "valid": true,
      "visible": true
    },
    {
      "id": "cert-002",
      "name": "Cisco Certified Network Associate (CCNA)",
      "issuer": "Cisco Networking Academy",
      "year": "2019",
      "valid": true,
      "visible": true
    },
    {
      "id": "cert-003",
      "name": "Cybersecurity & Network Security",
      "issuer": "Udemy",
      "year": "2022",
      "valid": true,
      "visible": true
    },
    {
      "id": "cert-004",
      "name": "SQL Server Database Administration",
      "issuer": "Microsoft / Academy",
      "year": "2021",
      "valid": true,
      "visible": true
    },
    {
      "id": "cert-005",
      "name": "Cloud / AWS Basics",
      "issuer": "Online Platform",
      "year": "2021",
      "valid": true,
      "visible": true
    }
  ],
  "referees": "References available upon request.",
  "sectionOrder": [
    "summary",
    "skills",
    "experiences",
    "certifications",
    "education",
    "referees"
  ],
  "sectionVisibility": {
    "summary": true,
    "keyStats": false,
    "skills": true,
    "experiences": true,
    "certifications": true,
    "education": true,
    "referees": true
  }
}